posts/2020-11-25-unity-shader-rumen-jingyao-00/index.html
<!DOCTYPE html>
<html>
	<head>
		<meta charset="utf-8">
		<meta name="viewport" content="width=device-width">
		

		<title>Unity Shader入门精要笔记 零</title>

		
		<link rel="stylesheet" href="https://www.young40.com/css/colors-dark.min.14df29dc468d31c46cb59a9b259c6e5c1623b01cee7d55d63f81e588d3496fc6.css">


	</head>
	<body>
		<header id="header">
			<h1><a href="https://www.young40.com/">杨世玲的博客</a></h1>
			<p></p>
		</header>

		<div id="page">
			<div id="sidebar">
				<nav>
	
		<ul class="nav">
			
				<li><a href="/"><span>Home</span></a></li>
			
				<li><a href="/index.xml"><span>RSS</span></a></li>
			
				<li><a href="/tags"><span>Tags</span></a></li>
			
				<li><a href="/categories"><span>分类</span></a></li>
			
				<li><a href="/hexoblog/"><span>历史文章</span></a></li>
			
		</ul>
	
</nav>

			</div>

			<div id="content">
				
	<article class="post">
		<h1><a href="https://www.young40.com/posts/2020-11-25-unity-shader-rumen-jingyao-00/">Unity Shader入门精要笔记 零</a> </h1>

		<div class="post-content"><p>
&lt;&lt;Unity Shader 入门精要&gt;&gt; 是国内关于Unity Shader的稀有的一本书, 也几乎是每一位有志于学习Unity Shader的开发者必读之书.
最近我开始学习Unity Shader, 计划详读此书并记录笔记和感悟.</p>
<p>
本书出版于2016年, 市面上约50元价格非常实惠, 再遇到各种优惠非常超值. 亚马逊上有约15元的电子书, 四舍五入几乎等于不要钱.
另外本书也上架了微信阅读, 可以用免费无限卡白嫖. 尽管市面上盗版PDF唾手可得, 实在是不推荐看盗版书.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
下面列一些关于本书的一些链接, 相信会对学习本书大有裨益.
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>
<p>本书配套源码托管于Github:
<a href="https://github.com/candycat1992/Unity_Shaders_Book">https://github.com/candycat1992/Unity_Shaders_Book</a></p>
</li>
<li>
<p>随书所有彩色插图:
<a href="http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_images.html">http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_images.html</a></p>
</li>
<li>
<p>本书勘误:
<a href="http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_corrigenda.html">http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_corrigenda.html</a></p>
</li>
<li>
<p>另外作者也公开了本书的第四章(关于数学部分):
<a href="http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_chapter_4.pdf">http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_chapter_4.pdf</a></p>
</li>
<li>
<p>重写了本书的第十八章(基于物理的渲染):
<a href="http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_chapter_18.pdf">http://candycat1992.github.io/unity_shaders_book/unity_shaders_book_chapter_18.pdf</a></p>
</li>
<li>
<p>作者冯乐乐的博客地址(已经不更新了, 但部分博文依然值得一读):
<a href="https://blog.csdn.net/candycat1992">https://blog.csdn.net/candycat1992</a></p>
</li>
<li>
<p>作者知乎首页:
<a href="https://www.zhihu.com/people/lele-feng-15">https://www.zhihu.com/people/lele-feng-15</a></p>
</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
以下是我关于本书所有笔记索引:
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<ul>
<li>
<p>第1章 欢迎来到Shader的世界</p>
</li>
<li>
<p>第2章 渲染流水线</p>
</li>
<li>
<p>第3章 Unity Shader基础</p>
</li>
<li>
<p>第4章 学习Shader所需的数学基础</p>
</li>
<li>
<p>第5章 开始Unity Shader学习之旅</p>
</li>
<li>
<p>第6章 Unity 中的基础光照</p>
</li>
<li>
<p>第7章 基础纹理</p>
</li>
<li>
<p>第8章 透明效果</p>
</li>
<li>
<p>第9章 更复杂的光照</p>
</li>
<li>
<p>第10章 高级纹理</p>
</li>
<li>
<p>第11章 让画面动起来</p>
</li>
<li>
<p>第12章 屏幕后处理效果</p>
</li>
<li>
<p>第13章 使用深度和纹理法线</p>
</li>
<li>
<p>第14章 非真实感渲染</p>
</li>
<li>
<p>第15章 使用噪声</p>
</li>
<li>
<p>第16章 Unity 中的渲染优化技术</p>
</li>
<li>
<p>第17章 Unity 的表面着色器探秘</p>
</li>
<li>
<p>第18章 急于物理的渲染</p>
</li>
<li>
<p>第19章 Unity 5 更新了什么</p>
</li>
<li>
<p>第20章 还有更多内容吗</p>
</li>
</ul>
</div>
</div></div>

		<p class="meta">Posted on <span class="postdate">25. November 2020</span></p>
	</article>

			</div>

			<footer id="footer">
				<p class="copyright">
					
						© 2019 Copyright 杨世玲
					
				</p>
			</footer>
		</div>

		
	</body>
</html>
